{
  "backend/main.mo": "Main Motoko actor defining store details, users, categories, products, and authorization-protected CRUD operations with mixins for storage and access control.",
  "feature_evidence.json": "Feature evidence report documenting a frontend fix for modal history management in ProductDetailModal.tsx.",
  "frontend-file-summaries.txt": "Text map summarizing multiple frontend files and their responsibilities across routing, UI, admin pages, and hooks.",
  "frontend/index.css": "Tailwind CSS configuration defining design tokens, light/dark theme variables, and base styles.",
  "frontend/index.html": "Basic HTML entry point loading the root React app via main.tsx.",
  "frontend/public/.well-known/ii-alternative-origins": "Defines allowed alternative origins for Internet Identity authentication.",
  "frontend/src/App.tsx": "Sets up TanStack Router with public and admin routes, layouts, and product detail routing.",
  "frontend/src/components/AccessDenied.tsx": "Access denied UI showing principal ID with copy and logout actions, clearing auth and React Query cache.",
  "frontend/src/components/BulkCreateModal.tsx": "Modal for creating multiple categories from newline‑separated input with preview and auto‑assigned order.",
  "frontend/src/components/BulkUpdateModal.tsx": "Empty file with no implementation.",
  "frontend/src/components/CategoriesDropdown.tsx": "Dropdown that lists categories from API, supports hover/toggle, navigation, and closing on outside click or Escape.",
  "frontend/src/components/CategoryModal.tsx": "Modal for creating or editing a category with name and order fields and save handling.",
  "frontend/src/components/CookieConsent.tsx": "Cookie consent banner that stores user preference in localStorage and supports accept, decline, and close animations.",
  "frontend/src/components/DashboardCards.tsx": "Grid of dashboard navigation cards linking to admin sections using icons and gradient backgrounds.",
  "frontend/src/components/DashboardHeader.tsx": "Header with sidebar toggle, title, logout, and a session keep‑alive worker lifecycle manager.",
  "frontend/src/components/DashboardHome.tsx": "Dashboard landing page showing a title and the main navigation cards.",
  "frontend/src/components/DashboardLayout.tsx": "Overall dashboard layout with header, responsive sidebar, routed content area, and footer.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Simple confirmation dialog component that blocks actions while loading and triggers onConfirm or onClose.",
  "frontend/src/components/DeleteProductDialog.tsx": "Delete dialog requiring a specific password before confirming product deletion, with input handling and loading state.",
  "frontend/src/components/Footer.tsx": "Footer showing store info, contact details, social links, and navigation, using store data if available.",
  "frontend/src/components/HeaderSearch.tsx": "Header search bar with debounced product search, abortable requests, and redirect to results page.",
  "frontend/src/components/home/CategoriesDisplay.tsx": "Fetches and displays product categories with infinite scroll and responsive load limits.",
  "frontend/src/components/home/CategorySection.tsx": "Renders a category header and its products with a link to view all products in that category.",
  "frontend/src/components/home/ProductCard.tsx": "Displays a product card with image handling, stock and featured badges, and navigation or selection behavior.",
  "frontend/src/components/home/ProductGrid.tsx": "Responsive product grid showing a limited number of products depending on screen size.",
  "frontend/src/components/home/ProductImage.tsx": "Empty file with no implementation.",
  "frontend/src/components/home/StockBadge.tsx": "Renders a badge indicating whether a product is in stock or out of stock.",
  "frontend/src/components/ImageLightbox.tsx": "Empty placeholder component file.",
  "frontend/src/components/LoadingSpinner.tsx": "Full‑screen loading component displaying a spinner and permission‑checking message.",
  "frontend/src/components/LoginInterface.tsx": "Login screen using Internet Identity with a styled button and branding.",
  "frontend/src/components/MobileMenu.tsx": "Mobile navigation drawer with category list, scroll lock, escape‑to‑close, and route navigation.",
  "frontend/src/components/pages/AdminUsersPage.tsx": "Admin page for managing user roles, including searching, filtering, promoting, and demoting users with confirmation dialogs.",
  "frontend/src/components/pages/CategoriesPage.tsx": "UI for listing, filtering, adding, editing, deleting, and reordering categories with react-query mutations and modals.",
  "frontend/src/components/pages/ImportPage.tsx": "Handles JSON drag-and-drop or file upload to validate and bulk-import products or categories, showing previews, errors, and automatic import execution.",
  "frontend/src/components/pages/ProductsPage.tsx": "Product management view providing search, filtering, pagination, featured toggles, and CRUD operations using react-query and modals.",
  "frontend/src/components/pages/StoreDetailsPage.tsx": "Form-driven page to view and update store info, hours, coordinates, and banner image with validation and image compression.",
  "frontend/src/components/ProductCard.tsx": "Product card with image loading fallback, stock badge, and navigation to product detail page.",
  "frontend/src/components/ProductDetailModal.tsx": "Modal that displays product details, manages focus, ESC/hardware back handling, scroll locking, and history state for navigation.",
  "frontend/src/components/ProductDetailView.tsx": "Displays product details including image handling, sharing, WhatsApp contact, and optional back/close controls.",
  "frontend/src/components/ProductModal.tsx": "Form modal for creating or editing products with fields, image compression, clipboard helpers, and category selection.",
  "frontend/src/components/PublicHeader.tsx": "Public site header with logo, navigation links, and a mobile menu toggle.",
  "frontend/src/components/PublicLayout.tsx": "Layout wrapper with header, footer, routed content, and conditional cookie consent.",
  "frontend/src/components/SafeSelect.tsx": "Select component enforcing sentinel values to avoid empty-string errors, with helpers for initialization and conversion.",
  "frontend/src/components/SearchBar.tsx": "Search bar with debounced queries, autocomplete, full results view, and product detail modal integration.",
  "frontend/src/components/SidebarNavigation.tsx": "Sidebar component rendering admin navigation links and handling route changes with active-state styling and mobile overlay.",
  "frontend/src/components/StoreBanner.tsx": "Displays a store banner with static imagery and dynamic WhatsApp link populated from store details.",
  "frontend/src/components/Toast.tsx": "Toast component managing timed display, pause/resume behavior, icons, and dismissal via a global toast store.",
  "frontend/src/components/ToastContainer.tsx": "Container that renders all active toasts from the toast store.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user’s identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, logout, stored identity loading, and exposing status flags.",
  "frontend/src/hooks/useProductDetail.ts": "Empty or placeholder file with no implemented logic.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin status, roles, categories, and products using an actor API with caching and mutation support.",
  "frontend/src/hooks/useToast.ts": "Provides helper functions to trigger success, error, warning, and info toast notifications.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, global styles, and custom toast notification component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminRoute.tsx": "Route guard that checks authentication and admin status, showing login, loading, or access denied screens as needed.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a category with infinite scrolling products, fetching paginated data and managing local product state.",
  "frontend/src/pages/ContactPage.tsx": "Shows store contact details with formatted phone and map links, handling loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Home page that loads categories with products, handles initial loading, and shows product details in a modal.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the privacy policy page, fetching store details and displaying static policy sections with scroll-to-top behavior.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information with loading, error, and not-found states, dynamic title updates, and cleanup of product queries.",
  "frontend/src/stores/toastStore.ts": "Implements a Zustand store for managing toast notifications, including adding, removing, pausing, and resuming toasts.",
  "frontend/src/utils/ApiResponseHandler.ts": "Provides standardized handling of API responses with BigInt parsing, error normalization, and utility functions for constructing API errors.",
  "frontend/src/utils/BigIntSerializer.ts": "Offers utilities for safely converting, validating, parsing, and serializing BigInt values in JSON.",
  "frontend/src/utils/NumericConverter.ts": "Contains functions for safely converting values to numbers and validating IVA and profit margin values with Spanish locale support.",
  "frontend/src/utils/phoneFormatter.ts": "Provides functions to normalize phone numbers for WhatsApp API and format them into Spanish display format.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read, store, persist, and clear URL and session parameters, including hash-based routing handling.",
  "frontend/src/workers/session-worker.js": "A web worker that periodically sends keep-alive messages by dispatching synthetic mousemove events.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, typography, container queries, animations, and theme customizations.",
  "project_state.json": "Project state metadata describing a fix request for ProductDetailModal history handling and related known issues."
}