{
  "backend/main.mo": "Motoko actor defining store details, categories, products, user roles, and related CRUD logic with integrated access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing routing, admin UI, hooks, and component behavior.",
  "frontend/index.css": "Tailwind CSS configuration defining color variables, theming, and base styling for light and dark modes.",
  "frontend/index.html": "HTML entry point bootstrapping the React application via main.tsx.",
  "frontend/public/.well-known/ii-alternative-origins": "Configuration file specifying allowed Internet Identity alternative origins for the app.",
  "frontend/src/App.tsx": "Main routing configuration using TanStack Router for public and admin pages with nested layouts and category routes.",
  "frontend/src/components/AccessDenied.tsx": "Component displaying access denial message with principal ID, copy functionality, and logout workflow tied to session cleanup.",
  "frontend/src/components/BulkCreateModal.tsx": "Modal for creating multiple categories at once with line‑based input and preview of computed order values.",
  "frontend/src/components/BulkUpdateModal.tsx": "Empty or placeholder file with no implementation.",
  "frontend/src/components/CategoriesDropdown.tsx": "Dropdown menu listing categories fetched from API, allowing navigation to a selected category.",
  "frontend/src/components/CategoryModal.tsx": "Modal form for creating or editing a single category, handling name and order fields.",
  "frontend/src/components/CookieConsent.tsx": "Cookie consent banner with accept/decline actions persisted in localStorage.",
  "frontend/src/components/DashboardCards.tsx": "Grid of dashboard navigation cards linking to admin sections like products, categories, and stats.",
  "frontend/src/components/DashboardHeader.tsx": "Dashboard header with sidebar toggle, session‑keepalive worker logic, and logout handling.",
  "frontend/src/components/DashboardHome.tsx": "Dashboard homepage showing a welcome message and the main navigation cards.",
  "frontend/src/components/DashboardLayout.tsx": "Layout wrapper with header, responsive sidebar, main content outlet, and footer.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Generic confirmation dialog for delete actions with loading state handling.",
  "frontend/src/components/DeleteProductDialog.tsx": "Delete dialog requiring a specific confirmation password before allowing product deletion.",
  "frontend/src/components/Footer.tsx": "Footer showing store info, contact details, formatted phone links, and social links.",
  "frontend/src/components/HeaderSearch.tsx": "Search bar with debounced queries, abortable requests, and navigation to results page.",
  "frontend/src/components/home/CategoriesDisplay.tsx": "Loads categories with products and implements infinite scrolling with responsive display counts.",
  "frontend/src/components/home/CategorySection.tsx": "Renders a category header and product grid, with navigation to full category and product select handling.",
  "frontend/src/components/home/ProductCard.tsx": "Renders an individual product card with image loading logic, stock/featured badges, and click navigation.",
  "frontend/src/components/home/ProductGrid.tsx": "Responsive grid that shows a limited number of products and delegates rendering to ProductCard.",
  "frontend/src/components/home/ProductImage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/home/StockBadge.tsx": "Displays in‑stock or out‑of‑stock status using styled badges and icons.",
  "frontend/src/components/ImageLightbox.tsx": "Empty placeholder component file.",
  "frontend/src/components/LoadingSpinner.tsx": "Full‑screen loading spinner used during permission checks.",
  "frontend/src/components/LoginInterface.tsx": "Login screen using Internet Identity with a styled UI and loading state.",
  "frontend/src/components/MobileMenu.tsx": "Mobile slide‑in menu with navigation links, category list, and scroll/escape handling.",
  "frontend/src/components/pages/AdminUsersPage.tsx": "Admin page for listing, filtering, adding, and modifying user roles with confirmation dialogs and toasts.",
  "frontend/src/components/pages/CategoriesPage.tsx": "Admin page to list, search, sort, add, edit, delete, and reorder categories with React Query and modals.",
  "frontend/src/components/pages/ImportPage.tsx": "Handles drag‑and‑drop JSON import for products and categories, including validation, previews, and bulk upload.",
  "frontend/src/components/pages/ProductsPage.tsx": "Admin page for listing, filtering, paginating, adding, editing, deleting, and updating product attributes.",
  "frontend/src/components/pages/StoreDetailsPage.tsx": "Form for viewing and updating store info, hours, coordinates, and banner image with compression support.",
  "frontend/src/components/ProductCard.tsx": "Product card displaying image, details, stock status, and navigation to product page.",
  "frontend/src/components/ProductDetailModal.tsx": "Modal wrapper that manages history, focus trapping, scroll lock, and close behavior for displaying ProductDetailView.",
  "frontend/src/components/ProductDetailView.tsx": "Renders detailed product information with image handling, sharing, WhatsApp contact, and optional back/close controls.",
  "frontend/src/components/ProductModal.tsx": "Form modal for creating or editing products, including image upload/compression and validation of product fields.",
  "frontend/src/components/PublicHeader.tsx": "Public site header with logo, desktop navigation, and a toggleable mobile menu.",
  "frontend/src/components/PublicLayout.tsx": "Layout wrapper providing header, footer, routed content, and conditional cookie consent.",
  "frontend/src/components/SafeSelect.tsx": "Select component wrapper enforcing sentinel values to avoid empty-string errors and providing helper utilities.",
  "frontend/src/components/SearchBar.tsx": "Search input with debouncing, autocomplete, full results handling, and optional product selection modal.",
  "frontend/src/components/SidebarNavigation.tsx": "Sidebar menu component rendering navigation items with active highlighting and mobile overlay handling.",
  "frontend/src/components/StoreBanner.tsx": "Displays a hero banner with store info, WhatsApp link, and promotional text using store details.",
  "frontend/src/components/Toast.tsx": "Toast notification component managing timers, pause/resume behavior, icons, and dismissal.",
  "frontend/src/components/ToastContainer.tsx": "Container that renders all active toasts from the toast store.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, manages login state, stored identities, and interaction with AuthClient.",
  "frontend/src/hooks/useProductDetail.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks for user profiles, admin status, roles, categories, products, and store data, stabilizing actor references and caching behavior.",
  "frontend/src/hooks/useToast.ts": "Exposes helper methods to trigger success, error, warning, and info toast notifications.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode overrides, and detailed styles for a toast notification system.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminRoute.tsx": "Protects admin-only routes by checking identity and admin status, showing loading, login, or access-denied states.",
  "frontend/src/pages/CategoryPage.tsx": "Displays category details and infinite-scrolling product lists with pagination, actor stabilization, and query cleanup.",
  "frontend/src/pages/ContactPage.tsx": "Shows store contact information with formatted links and handles loading, errors, and query cleanup.",
  "frontend/src/pages/HomePage.tsx": "Renders the store homepage with banner, search, categories-with-products, and product detail modal, managing loading states and query cleanup.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders a privacy policy page with store details and static sections about collected data and usage purposes.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information with loading, error, and not-found states, handling title updates, animations, and query cleanup.",
  "frontend/src/stores/toastStore.ts": "Implements a Zustand store for managing toast notifications with add, remove, pause, and resume actions plus helper creators.",
  "frontend/src/types/productDetail.ts": "Defines shared types for product selection, including category details and product references.",
  "frontend/src/utils/ApiResponseHandler.ts": "Provides standardized API response parsing with error handling, retry logic support, and BigInt-aware JSON parsing.",
  "frontend/src/utils/BigIntSerializer.ts": "Utilities for safely converting, validating, parsing, and stringifying BigInt values within JSON operations.",
  "frontend/src/utils/NumericConverter.ts": "Offers safe numeric conversions and validations, including IVA and profit margin checks with Spanish locale formatting.",
  "frontend/src/utils/phoneFormatter.ts": "Provides functions to clean and normalize phone numbers for WhatsApp API usage and to format cleaned Spanish numbers for display.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/src/workers/session-worker.js": "A web worker that periodically sends keep-alive messages by emitting synthetic activity every 60 seconds.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing frontend refactor goals, constraints, and existing feature requirements."
}