{
  "backend/main.mo": "Main Motoko actor implementing a retail store management system with user profiles, store details, categories, products, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting the Internet Identity alternative origins configuration for multiple aftabstore.com domains.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend React components, pages, and hooks describing routing, authentication, admin management, product/category CRUD, and query patterns with stable actor usage.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Aftab Store Admin Management System React application.",
  "frontend/public/.well-known/ii-alternative-origins": "Internet Identity alternative origins configuration JSON listing four aftabstore.com domain variants for authentication.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with public routes (home, product detail, category, contact, privacy) and protected admin routes (dashboard, products, categories, users, store, import).",
  "frontend/src/components/AccessDenied.tsx": "Access denied screen for non-admin users displaying their principal ID with copy functionality and logout button that terminates session worker and clears state.",
  "frontend/src/components/BulkCreateModal.tsx": "Modal dialog for bulk category creation accepting newline-separated category names with live preview table showing auto-assigned order numbers.",
  "frontend/src/components/BulkUpdateModal.tsx": "Modal component for bulk updating category data (content truncated in provided source).",
  "frontend/src/components/CategoriesDropdown.tsx": "A dropdown component that fetches and displays categories sorted by order, with hover/click interactions and keyboard navigation support. Navigates to category pages when a category is selected.",
  "frontend/src/components/CategoryModal.tsx": "A reusable modal dialog for creating or editing categories with name (required) and order (optional) fields. Handles form submission and loading states.",
  "frontend/src/components/CookieConsent.tsx": "A cookie consent banner that appears on first visit, allowing users to accept or decline cookies. Stores preference in localStorage and links to privacy policy.",
  "frontend/src/components/DashboardCards.tsx": "Displays a grid of navigation cards for admin dashboard sections (Products, Categories, Admins, Store Details, Import, Statistics). Each card navigates to its respective route when clicked.",
  "frontend/src/components/DashboardHeader.tsx": "Dashboard header with sidebar toggle, logout button, and session keep-alive worker initialization. Manages Web Worker lifecycle for maintaining active sessions and handles cleanup on logout.",
  "frontend/src/components/DashboardHome.tsx": "Main dashboard home page component that displays a welcome message and renders the DashboardCards grid. Includes cleanup effect for query client state.",
  "frontend/src/components/DashboardLayout.tsx": "Layout wrapper for dashboard pages with responsive sidebar, header, and main content area. Handles sidebar toggle state and auto-closes on mobile when menu items are clicked.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "A reusable alert dialog for confirming delete actions with customizable title and description. Handles loading states and prevents interaction during deletion.",
  "frontend/src/components/DeleteProductDialog.tsx": "A specialized delete confirmation dialog for products that requires typing 'DeleteIsUnsafe' as a safety measure. Includes password validation and loading state management.",
  "frontend/src/components/Footer.tsx": "Footer component displaying store information, contact details (phone/WhatsApp with formatted links), social media icons, and navigation links. Fetches store details from API with fallback values.",
  "frontend/src/components/HeaderSearch.tsx": "Search input component with debounced search functionality that queries products by name and redirects to search results page. Includes abort controller for canceling pending requests and accessibility features.",
  "frontend/src/components/home/CategoriesDisplay.tsx": "Displays categories with products using infinite scroll/lazy loading, showing initial categories (3 mobile, 5 desktop) and loading more on intersection observer trigger.",
  "frontend/src/components/home/CategorySection.tsx": "Renders a single category section with title, product count, optional 'View All' button, and a product grid with click handlers.",
  "frontend/src/components/home/ProductCard.tsx": "Product card component displaying product image with fallback, featured badge, stock badge, name, and description with hover effects.",
  "frontend/src/components/home/ProductGrid.tsx": "Responsive grid layout for products that displays 4 products on mobile and 5 on desktop with debounced resize handling.",
  "frontend/src/components/home/ProductImage.tsx": "Empty file with no content.",
  "frontend/src/components/home/StockBadge.tsx": "Badge component displaying product stock status with green 'En Stock' or red 'Sin Stock' variants with icons.",
  "frontend/src/components/ImageLightbox.tsx": "Empty file with no content.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple loading spinner component with centered layout showing an animated loader icon and 'Verificando permisos...' message.",
  "frontend/src/components/LoginInterface.tsx": "Login page component using Internet Identity authentication with branded UI, login button with loading state, and footer attribution.",
  "frontend/src/components/MobileMenu.tsx": "Slide-in mobile navigation menu with backdrop overlay, displaying navigation links and sorted categories. Includes keyboard navigation, body scroll lock, and focus management.",
  "frontend/src/components/pages/AdminUsersPage.tsx": "Admin page for managing user roles with search/filter, promoting users to admin, demoting admins, and preventing removal of the last admin with confirmation dialogs.",
  "frontend/src/components/pages/CategoriesPage.tsx": "Admin page for managing categories with CRUD operations, search filtering, drag-to-reorder functionality, and validation to prevent deleting categories with associated products.",
  "frontend/src/components/pages/ImportPage.tsx": "Provides a tabbed UI for importing products and categories from JSON files via drag-and-drop or file selection, with validation, preview, and automatic import triggering upon successful parsing.",
  "frontend/src/components/pages/ProductsPage.tsx": "Admin page for managing products with search, category filtering, pagination, and CRUD operations including stock toggling and featured status updates; includes mobile responsiveness and query cleanup on unmount.",
  "frontend/src/components/pages/StoreDetailsPage.tsx": "Admin page for editing store details including name, address, contact info, store hours, coordinates, and banner image with WebP compression; supports form reset and preview.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image with fallback, name, description, barcode, and stock status badge. Handles image loading states and navigates to product detail on click.",
  "frontend/src/components/ProductDetailModal.tsx": "Modal wrapper for product details with history state management, focus trap, ESC key handling, body scroll prevention, and popstate event handling for browser back button support.",
  "frontend/src/components/ProductDetailView.tsx": "Displays detailed product information including image, name, description, barcode, category, and stock status with actions to copy barcode, share URL, and contact via WhatsApp. Handles image loading with fallback to default image and supports both back and close button navigation.",
  "frontend/src/components/ProductModal.tsx": "Modal form for creating/editing products with fields for barcode, name, category, description, stock status, featured flag, and photo upload. Includes image compression to WebP format, photo preview, and validation for file size limits.",
  "frontend/src/components/PublicHeader.tsx": "Sticky header component for public pages with logo, desktop navigation (Home, Categories dropdown, Contact), mobile menu button, and accessibility skip-to-content link.",
  "frontend/src/components/PublicLayout.tsx": "Layout wrapper for public pages that includes PublicHeader, main content outlet, Footer, and conditionally renders CookieConsent (hidden on privacy policy page).",
  "frontend/src/components/SafeSelect.tsx": "Wrapper around Select component that enforces sentinel values ('none', 'all', 'no-change') instead of empty strings to prevent errors, with utility functions for sentinel validation and conversion to null for API calls.",
  "frontend/src/components/SearchBar.tsx": "Search input with debounced autocomplete dropdown showing up to 10 results and full results view on submit. Opens ProductDetailModal when a product is selected and handles click-outside and escape key to close.",
  "frontend/src/components/SidebarNavigation.tsx": "Admin sidebar navigation with menu items for Home, Products, Categories, Admin Users, Store Details, and Import pages. Includes mobile overlay and highlights active route.",
  "frontend/src/components/StoreBanner.tsx": "Hero banner component displaying store image with overlay, store name, description of products/services, and dynamic WhatsApp contact link loaded from store details.",
  "frontend/src/components/Toast.tsx": "Toast notification component with auto-dismiss timer, pause/resume on hover, and different types (success, error, warning, info) with corresponding icons and styles.",
  "frontend/src/components/ToastContainer.tsx": "Container component that renders all active toasts from the toast store in a fixed position on the page.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useProductDetail.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend operations including user profiles, admin status, user roles, categories, products, store details, and search with stable actor references and cache management.",
  "frontend/src/hooks/useToast.ts": "Simple hook wrapper around the toast store providing helper methods for success, error, warning, and info notifications with optional duration.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for light and dark themes (colors, radius, charts), and includes custom toast notification component styles with animations and responsive behavior.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminRoute.tsx": "Protected route component that checks authentication and admin status, displaying LoginInterface for unauthenticated users, AccessDenied for non-admins, LoadingSpinner during checks, and Outlet for authorized admins.",
  "frontend/src/pages/CategoryPage.tsx": "Category product listing page with infinite scroll pagination that fetches and displays products by category, handles scroll-triggered loading with cooldown/throttling, and includes product detail modal functionality with cleanup on unmount.",
  "frontend/src/pages/ContactPage.tsx": "Contact information page that displays store details including address, phone, WhatsApp, email, store hours, and embedded Google Maps with formatted Spanish phone numbers and loading/error states.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that displays store banner, search bar, and categories with products in a grid layout, manages product detail modal state, and includes loading/error/empty states with query cleanup on unmount.",
  "frontend/src/pages/PrivacyPage.tsx": "Privacy policy page that displays information about data collection (contact info, cookies, navigation data), usage purposes (functionality, analytics, Google Maps integration), and scrolls to top on mount.",
  "frontend/src/pages/ProductDetailPage.tsx": "React page component that displays detailed product information using route params (barcode), handles loading/error states, manages fade-in animations, and cleans up queries on unmount.",
  "frontend/src/stores/toastStore.ts": "Zustand store for managing toast notifications with support for different types (success, error, warning, info), pause/resume functionality, and helper functions for creating toasts with type-specific default durations.",
  "frontend/src/utils/ApiResponseHandler.ts": "Provides standardized API response handling with BigInt support, error classification, retry logic determination, and Spanish error messages for different HTTP status codes and network conditions.",
  "frontend/src/utils/BigIntSerializer.ts": "Utilities for safe BigInt serialization/deserialization in JSON, automatically converting fields containing 'date', 'timestamp', or 'id' to BigInt during parsing and back to strings during stringification.",
  "frontend/src/utils/NumericConverter.ts": "Type-safe numeric conversion utilities with Spanish locale support (comma as decimal separator), including validation functions for IVA percentages (0, 4, 10, 21) and profit margins (0-1000%).",
  "frontend/src/utils/phoneFormatter.ts": "Phone number formatting utilities that clean and format Spanish phone numbers for WhatsApp API URLs (with country code 34) and display format (+34 XXX XX XX XX).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/workers/session-worker.js": "Web Worker that dispatches keep-alive messages every 60 seconds to maintain session activity by triggering synthetic mousemove events.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for Aftab Store defining Internet Identity integration with custom domain alternative origins configuration in the .well-known directory."
}