{
  "backend/main.mo": "Defines the backend canister with storage mixins, access control, and types plus CRUD logic for users, categories, products, and store details.",
  "feature_evidence.json": "Empty feature evidence report with a placeholder structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS configuration defining color variables and base styles for light and dark themes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/public/.well-known/ii-alternative-origins": "Specifies allowed alternative origins for Internet Identity.",
  "frontend/src/App.tsx": "Sets up TanStack Router with public and admin routes and layout components.",
  "frontend/src/components/AccessDenied.tsx": "Displays an access denied screen with principal copy, session termination, and logout behavior.",
  "frontend/src/components/BulkCreateModal.tsx": "Modal for bulk category creation with textarea input, preview table, and save handling.",
  "frontend/src/components/BulkUpdateModal.tsx": "Empty placeholder file with no implemented logic.",
  "frontend/src/components/CategoriesDropdown.tsx": "Dropdown component that fetches and displays categories, handles open/close interactions, and navigates to a category page on selection.",
  "frontend/src/components/CategoryModal.tsx": "Modal form for creating or editing a category, with controlled inputs for name and order and save/cancel handling.",
  "frontend/src/components/CookieConsent.tsx": "Cookie consent banner that shows on first visit, stores accept/decline choice in localStorage, and supports animated show/hide.",
  "frontend/src/components/DashboardCards.tsx": "Grid of admin dashboard cards that navigate to various management sections, each styled with icon and gradient.",
  "frontend/src/components/DashboardHeader.tsx": "Dashboard header with sidebar toggle, title, logout logic, and initialization/cleanup of a session keep-alive web worker.",
  "frontend/src/components/DashboardHome.tsx": "Dashboard home page displaying a welcome header and the main dashboard cards.",
  "frontend/src/components/DashboardLayout.tsx": "Dashboard layout that manages responsive sidebar behavior and wraps pages with header, sidebar, main content, and footer.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Generic delete confirmation dialog with title, description, and disabled-state handling during deletion.",
  "frontend/src/components/DeleteProductDialog.tsx": "Delete dialog requiring the user to type a specific password before confirming product deletion, with loading and reset logic.",
  "frontend/src/components/Footer.tsx": "Renders a footer showing store details, contact info with formatted phone numbers, and social links using data from store queries.",
  "frontend/src/components/HeaderSearch.tsx": "Implements a debounced product search bar that triggers actor-based searches and navigates to results, with abort and cleanup handling.",
  "frontend/src/components/home/CategoriesDisplay.tsx": "Fetches categories with products and displays them with infinite scrolling and responsive counts.",
  "frontend/src/components/home/CategorySection.tsx": "Displays a category header and its product grid with a link to view all products.",
  "frontend/src/components/home/ProductCard.tsx": "Shows a product card with image loading, featured and stock badges, and navigation/select handling.",
  "frontend/src/components/home/ProductGrid.tsx": "Responsive grid limiting displayed products based on viewport size.",
  "frontend/src/components/home/ProductImage.tsx": "Empty file.",
  "frontend/src/components/home/StockBadge.tsx": "Badge component indicating whether a product is in stock or not.",
  "frontend/src/components/ImageLightbox.tsx": "Empty placeholder file for an image lightbox component.",
  "frontend/src/components/LoadingSpinner.tsx": "Displays a full‑screen spinner and message used while verifying permissions.",
  "frontend/src/components/LoginInterface.tsx": "Provides a login screen using Internet Identity with a styled button and branding.",
  "frontend/src/components/MobileMenu.tsx": "Mobile slide‑in navigation menu showing links and categories, handling body scroll lock and escape-to-close.",
  "frontend/src/components/pages/AdminUsersPage.tsx": "Admin panel for listing, filtering, adding, promoting, and demoting user roles with confirmation dialogs.",
  "frontend/src/components/pages/CategoriesPage.tsx": "Admin interface for listing, searching, creating, editing, deleting, and reordering categories.",
  "frontend/src/components/pages/ImportPage.tsx": "UI page for importing products or categories from JSON files, validating data, showing previews, and auto-triggering bulk import mutations. Handles drag-and-drop, file parsing, error reporting, and import summaries.",
  "frontend/src/components/pages/ProductsPage.tsx": "Admin product listing with search, filtering, pagination, and CRUD actions including stock toggle and featured status updates. Manages modals, responsive behavior, and query lifecycle cleanup.",
  "frontend/src/components/pages/StoreDetailsPage.tsx": "Form page for viewing and updating store details such as contact info, hours, coordinates, and banner image. Handles image compression, file upload previews, and synchronization with backend data.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image loading fallback, barcode, stock badge, and navigation to product detail.",
  "frontend/src/components/ProductDetailModal.tsx": "Modal that fetches and displays detailed product info with loading, error, and focus/scroll management.",
  "frontend/src/components/ProductDetailView.tsx": "Displays detailed product information, handles image loading, barcode copying, sharing, and WhatsApp contact, with optional back/close controls.",
  "frontend/src/components/ProductModal.tsx": "Provides a form modal for creating or editing products, including image upload/compression, field initialization, validation, and save handling.",
  "frontend/src/components/PublicHeader.tsx": "Renders the public site header with logo, navigation links, and a mobile menu toggle.",
  "frontend/src/components/PublicLayout.tsx": "Defines the public page layout with header, footer, routed content, and conditional cookie consent.",
  "frontend/src/components/SafeSelect.tsx": "Implements a select component that enforces sentinel values and prevents empty-string errors, with helper utilities.",
  "frontend/src/components/SearchBar.tsx": "Implements a debounced product search with autocomplete, full results toggle, and product detail modal integration.",
  "frontend/src/components/SidebarNavigation.tsx": "Renders the admin sidebar navigation with route highlighting and mobile overlay handling.",
  "frontend/src/components/StoreBanner.tsx": "Displays a full-width banner with store branding, promotional text, and a dynamic WhatsApp contact link.",
  "frontend/src/components/Toast.tsx": "Toast component handling timed display, pause/resume on hover, and type-specific styling/icons.",
  "frontend/src/components/ToastContainer.tsx": "Renders active toasts from the store inside a container.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor tied to Internet Identity, refetching dependent queries when the actor changes. Initializes access control using a secret token if available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, managing login, logout, identity persistence, and status tracking. Wraps AuthClient setup and exposes identity state to consumers.",
  "frontend/src/hooks/useProductDetail.ts": "Hook that fetches a single product, categories, and store details, returning loading states and derived category name. Simplifies access to product detail data for UI components.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for backend operations including products, categories, store details, user profiles, roles, and admin checks. Handles stable actor usage, caching, and mutation side effects.",
  "frontend/src/hooks/useToast.ts": "Simple helper hook exposing success, error, warning, and info toast functions backed by the toastStore.",
  "frontend/src/index.css": "Configures Tailwind layers, defines light/dark theme CSS variables, and includes toast notification component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AdminRoute.tsx": "Protects admin-only routes by checking authentication and admin status, showing loading, login, or access-denied states.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a category’s products with infinite scrolling, manages pagination state, and cleans up related queries on unmount.",
  "frontend/src/pages/ContactPage.tsx": "Fetches and displays store contact info with loading and error handling, including phone, WhatsApp, email, and map links.",
  "frontend/src/pages/HomePage.tsx": "Loads featured categories with products, handles initial loading and errors, and supports product detail modals.",
  "frontend/src/pages/PrivacyPage.tsx": "Shows the privacy policy, using store details when available and scrolling to the top on mount.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page component that loads product data, manages loading/error states, updates title, and renders the product view with cleanup of related queries.",
  "frontend/src/stores/toastStore.ts": "Zustand store managing toast notifications with add, remove, pause, and resume functions plus helper creators.",
  "frontend/src/utils/ApiResponseHandler.ts": "Utility for standardized API response handling with BigInt parsing, error classification, and error object creation.",
  "frontend/src/utils/BigIntSerializer.ts": "BigInt-safe JSON parsing and stringifying utilities, including validation and conversion helpers.",
  "frontend/src/utils/NumericConverter.ts": "Utilities for safe numeric conversion and validation, including VAT and profit margin checks.",
  "frontend/src/utils/phoneFormatter.ts": "Phone formatting helpers for WhatsApp API and Spanish display, normalizing and formatting numbers.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from the hash.",
  "frontend/src/workers/session-worker.js": "A web worker that periodically posts keep‑alive messages to maintain an active admin session.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Project metadata describing the app’s purpose, architecture, and existing feature set."
}