{
  "backend/main.mo": "Defines the main canister actor with storage, authorization mixins, and types plus initial state for store, categories, products, and user profiles, including several user profile CRUD query and update functions.",
  "feature_evidence.json": "Contains feature evidence entries describing required frontend refactors, affected files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files documenting their purpose, behavior, and architectural notes.",
  "frontend/index.css": "Tailwind CSS setup defining custom theme variables and light/dark mode styles.",
  "frontend/index.html": "HTML root file that mounts the React app and loads main.tsx.",
  "frontend/public/.well-known/ii-alternative-origins": "Specifies allowed alternative origins for Internet Identity authentication.",
  "frontend/src/App.tsx": "Sets up the full TanStack Router tree including public and admin layouts, pages, and the product-detail dynamic route.",
  "frontend/src/components/AccessDenied.tsx": "Renders an access-denied screen with principal display, clipboard copy, and logout logic that clears identity, cache, and session worker.",
  "frontend/src/components/BulkCreateModal.tsx": "Modal for creating multiple categories at once, parsing newline-separated input and previewing assigned orders before saving.",
  "frontend/src/components/BulkUpdateModal.tsx": "Empty file with no implementation provided.",
  "frontend/src/components/CategoriesDropdown.tsx": "Dropdown listing categories fetched from the API, with sorting, navigation, and outside-click/escape close behavior.",
  "frontend/src/components/CategoryModal.tsx": "Modal for creating or editing a single category, allowing name and order input with validation and save handling.",
  "frontend/src/components/CookieConsent.tsx": "Cookie consent banner that stores user choice in localStorage and shows animated accept/decline options.",
  "frontend/src/components/DashboardCards.tsx": "Grid of navigation cards linking to admin sections, each with icon, description, and gradient styling.",
  "frontend/src/components/DashboardHeader.tsx": "Dashboard header with sidebar toggle, logout handling, and initialization of a session keep-alive web worker.",
  "frontend/src/components/DashboardHome.tsx": "Dashboard landing page showing welcome text and the admin navigation cards.",
  "frontend/src/components/DashboardLayout.tsx": "Layout wrapping dashboard pages with header, sidebar, responsive sidebar behavior, and footer.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Renders a generic delete confirmation dialog with title, description, and loading-safe confirm/cancel actions.",
  "frontend/src/components/DeleteProductDialog.tsx": "Displays a product deletion dialog requiring a specific password before calling the async confirm handler.",
  "frontend/src/components/Footer.tsx": "Shows store info, contact details, and social links using store data with formatted phone numbers.",
  "frontend/src/components/HeaderSearch.tsx": "Implements a debounced product search input that triggers actor-based search requests and navigates to results.",
  "frontend/src/components/home/CategoriesDisplay.tsx": "Loads and displays categories incrementally with infinite scroll and mobile/desktop adjustments.",
  "frontend/src/components/home/CategorySection.tsx": "Shows a category header and a product grid, linking to a full category view if large.",
  "frontend/src/components/home/ProductCard.tsx": "Displays clickable product card with image loading fallback, featured badge, and stock badge.",
  "frontend/src/components/home/ProductGrid.tsx": "Grid layout showing a limited number of products depending on screen size.",
  "frontend/src/components/home/ProductImage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/home/StockBadge.tsx": "Renders a badge indicating whether a product is in stock or out of stock.",
  "frontend/src/components/ImageLightbox.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/LoadingSpinner.tsx": "Full‑screen loading view with a spinning icon and permission verification message.",
  "frontend/src/components/LoginInterface.tsx": "Provides a login screen using Internet Identity with styled UI and a login button showing loading state.",
  "frontend/src/components/MobileMenu.tsx": "Creates a slide‑in mobile navigation menu with category listing, navigation links, and scroll/escape handling.",
  "frontend/src/components/pages/AdminUsersPage.tsx": "Admin interface for listing users, filtering, adding administrators, and managing role changes with confirmation dialogs.",
  "frontend/src/components/pages/CategoriesPage.tsx": "Admin page to list, search, sort, add, edit, delete, and reorder categories using React Query and modals. Includes filtering, optimistic actions, and toast notifications.",
  "frontend/src/components/pages/ImportPage.tsx": "Handles drag‑and‑drop JSON import for products and categories with validation, previews, and automatic bulk import. Supports error reporting and import summaries.",
  "frontend/src/components/pages/ProductsPage.tsx": "Admin product management page with search, filters, pagination, and CRUD operations. Supports toggling stock, featured status, and modal-driven editing.",
  "frontend/src/components/pages/StoreDetailsPage.tsx": "Form-driven page to view and edit store details, hours, coordinates, and banner image with compression. Loads existing data and supports saving or resetting changes.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image loading fallback, basic product info, and navigation to the product page.",
  "frontend/src/components/ProductDetailModal.tsx": "Modal that displays product details with focus trapping, ESC handling, scroll lock, and fallback UI for missing fields.",
  "frontend/src/components/ProductDetailView.tsx": "Renders detailed product info with image handling, sharing, copy actions, and WhatsApp contact options.",
  "frontend/src/components/ProductModal.tsx": "Form modal for creating or editing products, supporting image upload/compression and category selection.",
  "frontend/src/components/PublicHeader.tsx": "Public site header with logo, navigation links, and a mobile menu toggle.",
  "frontend/src/components/PublicLayout.tsx": "Layout wrapper providing header, footer, routed content, and conditional cookie consent banner.",
  "frontend/src/components/SafeSelect.tsx": "Select wrapper enforcing sentinel values to avoid empty-string errors, plus utility functions for handling them.",
  "frontend/src/components/SearchBar.tsx": "Search component with debounced queries, autocomplete results, full results view, and product detail modal integration.",
  "frontend/src/components/SidebarNavigation.tsx": "Sidebar component rendering admin navigation items with active state and mobile overlay.",
  "frontend/src/components/StoreBanner.tsx": "Displays store banner with static imagery and dynamic WhatsApp link from store details.",
  "frontend/src/components/Toast.tsx": "Toast component handling auto-dismiss timers, pause-on-hover behavior, and type-specific styles/icons.",
  "frontend/src/components/ToastContainer.tsx": "Container that renders all active toasts from the toast store.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, refreshing dependent queries when the actor changes. Supports anonymous mode and secret admin initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and stored identity restoration using AuthClient. Manages authentication state and exposes identity to consumers.",
  "frontend/src/hooks/useProductDetail.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for user profiles, admin status, roles, categories, and products with stable actor handling and cache invalidation.",
  "frontend/src/hooks/useToast.ts": "Provides a simple wrapper exposing success, error, warning, and info toast helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables for light/dark modes, and detailed toast component styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, and Internet Identity context.",
  "frontend/src/pages/AdminRoute.tsx": "Route guard that checks authentication and admin status, rendering login, loading, denied, or nested routes.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a category with infinite-scroll product loading, cleanup of related queries, and product detail modal support.",
  "frontend/src/pages/ContactPage.tsx": "Renders store contact info with loading/error handling and formatted phone, WhatsApp, and map links.",
  "frontend/src/pages/HomePage.tsx": "Shows store banner, search, category previews, and a product modal with initial loading and cleanup of category queries.",
  "frontend/src/pages/PrivacyPage.tsx": "React page that displays the store's privacy policy using store details and static sections, scrolling to top on mount.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that fetches product, category, and store data, manages loading/error states, updates page title, and cleans related queries on unmount.",
  "frontend/src/stores/toastStore.ts": "Zustand store managing toast notifications with add, remove, pause, and resume actions plus helper functions for common toast types.",
  "frontend/src/utils/ApiResponseHandler.ts": "Utility for standardized API response handling with BigInt parsing, error normalization, and automatic error-type generation.",
  "frontend/src/utils/BigIntSerializer.ts": "Helpers to safely stringify and parse JSON with BigInt support, including validation and automatic BigInt field conversion.",
  "frontend/src/utils/NumericConverter.ts": "Functions to safely convert values to numbers and validate IVA and profit margin inputs with Spanish locale support.",
  "frontend/src/utils/phoneFormatter.ts": "Provides functions to clean phone numbers for WhatsApp API and format them into Spanish display style.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/src/workers/session-worker.js": "Web worker that periodically sends keep‑alive messages by emitting synthetic mousemove events.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and container settings with plugins.",
  "project_state.json": "Project state describing current feature requirements, constraints, and architectural notes for ongoing work."
}