{
  "backend/main.mo": "Motoko canister defining store details, user profiles, categories, products, and authorization-backed CRUD APIs using mixins for storage and access control.",
  "feature_evidence.json": "Feature evidence report listing refactor requirements, affected frontend files, components, and associated test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of numerous frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables, light/dark mode palettes, and base styles.",
  "frontend/index.html": "Root HTML file mounting the React app at #root and loading main.tsx.",
  "frontend/public/.well-known/ii-alternative-origins": "Internet Identity configuration specifying allowed alternative origins for authentication.",
  "frontend/src/App.tsx": "Main React router setup defining public and admin routes, layouts, and page components using TanStack Router.",
  "frontend/src/components/AccessDenied.tsx": "Access-denied UI showing principal ID, copy functionality, and logout handling with session worker termination and cache clearing.",
  "frontend/src/components/BulkCreateModal.tsx": "Modal for entering multiple category names, previewing assigned orders, and submitting them in bulk.",
  "frontend/src/components/BulkUpdateModal.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/CategoriesDropdown.tsx": "Dropdown that loads, sorts, and displays categories, allowing navigation to a selected category.",
  "frontend/src/components/CategoryModal.tsx": "Modal for creating or editing a single category with name and order fields.",
  "frontend/src/components/CookieConsent.tsx": "Cookie consent banner that stores user choice in localStorage and supports animated show/hide.",
  "frontend/src/components/DashboardCards.tsx": "Grid of dashboard navigation cards linking to admin sections with icons and descriptions.",
  "frontend/src/components/DashboardHeader.tsx": "Header with sidebar toggle, session keep-alive worker setup, and logout handling.",
  "frontend/src/components/DashboardHome.tsx": "Dashboard landing page showing a welcome message and the main navigation cards.",
  "frontend/src/components/DashboardLayout.tsx": "Layout wrapping the admin dashboard with header, sidebar, responsive behavior, and routed content.",
  "frontend/src/components/DeleteConfirmDialog.tsx": "Confirmation dialog component for generic delete actions with loading state handling.",
  "frontend/src/components/DeleteProductDialog.tsx": "Product deletion dialog requiring a specific confirmation password before executing the delete action.",
  "frontend/src/components/Footer.tsx": "Footer displaying store details, contact info, social links, and navigation links using fetched store metadata.",
  "frontend/src/components/HeaderSearch.tsx": "Search bar component with debounced product search and navigation to search results.",
  "frontend/src/components/home/CategoriesDisplay.tsx": "Fetches categories with products and implements responsive incremental loading using an intersection observer.",
  "frontend/src/components/home/CategorySection.tsx": "Renders a category header and a product grid with navigation to full category view and product selection handling.",
  "frontend/src/components/home/ProductCard.tsx": "Product card showing image, stock status, featured badge, and basic info with fallback image logic.",
  "frontend/src/components/home/ProductGrid.tsx": "Grid that displays a limited number of products depending on screen size.",
  "frontend/src/components/home/ProductImage.tsx": "Empty placeholder file.",
  "frontend/src/components/home/StockBadge.tsx": "Small badge indicating whether a product is in stock using color and icons.",
  "frontend/src/components/ImageLightbox.tsx": "Empty placeholder file for an image lightbox component.",
  "frontend/src/components/LoadingSpinner.tsx": "Full‑screen loading spinner UI shown during permission checks.",
  "frontend/src/components/LoginInterface.tsx": "Login screen using Internet Identity with a styled UI and loading state.",
  "frontend/src/components/MobileMenu.tsx": "Mobile navigation drawer showing links and categories with scroll lock and escape‑to‑close support.",
  "frontend/src/components/pages/AdminUsersPage.tsx": "Admin user management page supporting filtering, role changes, adding admins, and confirmation dialogs.",
  "frontend/src/components/pages/CategoriesPage.tsx": "Manages category list with search, ordering, CRUD operations, and modal dialogs using react-query mutations.",
  "frontend/src/components/pages/ImportPage.tsx": "Handles JSON import of products or categories with validation, previews, drag‑and‑drop, and automatic bulk import.",
  "frontend/src/components/pages/ProductsPage.tsx": "Displays paginated, filterable products with CRUD, featured toggle, stock toggle, and responsive mobile behavior.",
  "frontend/src/components/pages/StoreDetailsPage.tsx": "Provides a form to view and update store details including contact info, hours, coordinates, and banner image compression.",
  "frontend/src/components/ProductCard.tsx": "Product card displaying image, name, description, barcode, and stock status with navigation to product details.",
  "frontend/src/components/ProductDetailModal.tsx": "Modal component handling product detail display with history, focus trapping, escape close, and scroll lock logic.",
  "frontend/src/components/ProductDetailView.tsx": "Displays product details including image loading, sharing, copying, and optional navigation controls.",
  "frontend/src/components/ProductModal.tsx": "Form modal for creating or editing products with image upload, compression, validation, and category selection.",
  "frontend/src/components/PublicHeader.tsx": "Public site header with logo, desktop navigation, and a mobile menu toggle.",
  "frontend/src/components/PublicLayout.tsx": "Layout wrapper including header, outlet rendering, footer, and conditional cookie consent.",
  "frontend/src/components/SafeSelect.tsx": "Safe wrapper around Select enforcing sentinel values and preventing empty string errors.",
  "frontend/src/components/SearchBar.tsx": "Search bar with debounced queries, autocomplete, full results handling, and product detail modal integration.",
  "frontend/src/components/SidebarNavigation.tsx": "Sidebar menu component that renders navigation buttons and handles route changes with active state styling and mobile overlay.",
  "frontend/src/components/StoreBanner.tsx": "Displays a large store banner with static text and a dynamic WhatsApp link loaded from store details.",
  "frontend/src/components/Toast.tsx": "Toast notification component with auto-dismiss timers, pause on hover, and type-based styling and icons.",
  "frontend/src/components/ToastContainer.tsx": "Container that renders all active toasts from the toast store.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity, login state, and providing an auth context.",
  "frontend/src/hooks/useProductDetail.ts": "Empty or placeholder file with no implementation.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks for fetching and mutating user profiles, roles, admin status, categories, products, and store data via a backend actor.",
  "frontend/src/hooks/useToast.ts": "Exposes convenience helpers for triggering success, error, warning, and info toast notifications.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables for light/dark modes, and full styling for a toast notification system.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminRoute.tsx": "Protects admin-only routes by checking authentication and admin status, showing login, loading, or access-denied states as needed.",
  "frontend/src/pages/CategoryPage.tsx": "Displays category details and implements infinite scrolling for category products using stabilized actor references and manual pagination.",
  "frontend/src/pages/ContactPage.tsx": "Loads and displays store contact details with formatted phone info, handling loading, error, and cleanup of related queries.",
  "frontend/src/pages/HomePage.tsx": "Shows store banner, search, category previews, and product modals while managing initial loading, errors, and query cleanup.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the store's privacy policy page using store details and static sections. Handles scroll-to-top behavior on mount.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information with loading, error, and not-found states, fetching product, category, and store data. Manages page title, animations, and cleans related queries on unmount.",
  "frontend/src/stores/toastStore.ts": "Implements a Zustand-based toast notification store with add, remove, pause, and resume functions. Provides helper methods for triggering typed toasts.",
  "frontend/src/utils/ApiResponseHandler.ts": "Provides standardized API response handling with BigInt parsing, error classification, and unified error object creation. Wraps fetch responses into a consistent ApiResponse format.",
  "frontend/src/utils/BigIntSerializer.ts": "Offers safe BigInt parsing and serialization utilities for JSON, including automatic field conversion and validation. Provides helpers for string-to-BigInt and BigInt-to-string conversions.",
  "frontend/src/utils/NumericConverter.ts": "Contains safe numeric conversion utilities supporting BigInt, strings, and Spanish decimal formats. Includes validators for IVA rates and profit margins.",
  "frontend/src/utils/phoneFormatter.ts": "Provides helpers to normalize phone numbers for WhatsApp API usage and format them into Spanish display format.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, and clear URL or session parameters, with support for hash-based routing.",
  "frontend/src/workers/session-worker.js": "Web worker that periodically sends keep‑alive messages by emitting synthetic activity every 60 seconds.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and layout features with plugins enabled.",
  "project_state.json": "Metadata describing the project's current refactor state, architectural rules, and existing feature requirements."
}