{
  "kind": "build_request",
  "title": "Fix ProductDetailModal double-click close by correcting history/popstate handling",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update `frontend/src/components/ProductDetailModal.tsx` history management so the modal closes on a single click of the close button by properly coordinating `history.pushState`, `window.history.back()`, and the `popstate` listener using refs to avoid race conditions. Specifically: (a) when `open` becomes true, push a history state once and set a `historyPushedRef` flag; (b) implement a unified close handler guarded by `isClosingRef` that calls `window.history.back()` only when a modal history entry was pushed (otherwise calls `onClose()` directly) and does not clear `historyPushedRef` before triggering `back()`; (c) add a `popstate` listener that, while the modal is open, clears `historyPushedRef` and calls `onClose()` so browser back (and the close button’s `history.back()`) reliably closes the modal in one action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Fix the double-click-to-close issue in the ProductDetailModal component by properly handling history.pushState and popstate events, ensuring the close button closes the modal immediately while maintaining support for overlay click, ESC key, and browser back button functionality."
        ]
      },
      "acceptanceCriteria": [
        "When the ProductDetailModal is open, clicking the close (X) button closes the modal with a single click (no second click required).",
        "When the ProductDetailModal is open, pressing the browser back button closes the modal and the user remains on the same in-app page (e.g., Home/Category/Search) without navigating away.",
        "Opening the ProductDetailModal pushes exactly one history entry per open cycle (no repeated pushes while it remains open).",
        "Closing via the close button uses `window.history.back()` only when a modal history entry was pushed; otherwise it calls `onClose()` directly.",
        "The `popstate` handler closes the modal reliably during the open state and resets internal history-tracking refs so subsequent opens/closes behave consistently.",
        "Overlay click-to-close and ESC-to-close continue to function (no regressions).",
        "Do not change modal structure, styling, layout, or close button positioning in the UI."
      ]
    }
  ],
  "constraints": [
    "Do not change the modal structure, styling, or layout.",
    "Do not change the right-side close (X) button position.",
    "Do not modify calling components/flows (HomePage, CategoryPage, Search).",
    "Preserve existing ESC key and overlay click close behavior (no regressions).",
    "Limit code changes to the ProductDetailModal history/popstate close logic; avoid unrelated refactors."
  ],
  "nonGoals": [
    "Adding new routes or changing the URL structure for product detail navigation.",
    "Introducing new modal animations or UI changes.",
    "Backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}