{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix ProductDetailModal single-click close via correct history/popstate coordination",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Adjust ProductDetailModal history push/back + popstate handling using refs so the close button and browser back reliably close the modal in one action without UI changes.",
      "acceptanceCriteria": [
        "When the ProductDetailModal is open, clicking the close (X) button closes the modal with a single click (no second click required).",
        "When the ProductDetailModal is open, pressing the browser back button closes the modal and the user remains on the same in-app page (e.g., Home/Category/Search) without navigating away.",
        "Opening the ProductDetailModal pushes exactly one history entry per open cycle (no repeated pushes while it remains open).",
        "Closing via the close button uses `window.history.back()` only when a modal history entry was pushed; otherwise it calls `onClose()` directly.",
        "The `popstate` handler closes the modal reliably during the open state and resets internal history-tracking refs so subsequent opens/closes behave consistently.",
        "Overlay click-to-close and ESC-to-close continue to function (no regressions).",
        "Do not change modal structure, styling, layout, or close button positioning in the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductDetailModal.tsx",
          "operation": "modify",
          "description": "Revise only the modal history/popstate close logic: (1) on `open === true`, push a single history state once per open cycle and set `historyPushedRef`; (2) implement a unified close handler guarded by `isClosingRef` that calls `window.history.back()` only if `historyPushedRef` is true (and crucially does not clear `historyPushedRef` before triggering `back()`), otherwise calls `onClose()` directly; (3) add/adjust a `popstate` listener that, while the modal is open, clears `historyPushedRef` and calls `onClose()` so both browser back and the close button’s `history.back()` reliably close the modal in one action. Preserve overlay click and ESC close behavior, and do not change modal structure/styling/layout."
        }
      ]
    }
  ]
}